"use strict";
alert(`Task3:

"" + 1 + 0 = ${"" + 1 + 0}
ответ: "10"

"" - 1 + 0 = ${"" - 1 + 0}
ответ: -1 (запомнить: пустая строка приводится к нолю)

true + false = ${true + false}
ответ: 1 (запомнить: булевы значения преобразуются к 1 и 0 при сложении)

6 / "3" = ${6 / "3"}
ответ: 2

"2" * "3" = ${"2" * "3"}
ответ: 6

4 + 5 + "px" = ${4 + 5 + "px"}
ответ: "9px"

"$" + 4 + 5 = ${"$" + 4 + 5}
ответ: "$45"

"4" - 2 = ${"4" - 2}
ответ: 2

"4px" - 2 = ${"4px" - 2}
ответ: Nan

"  -9  " + 5 = ${"  -9  " + 5}
ответ: "  -9  5"

"  -9  " - 5 = ${"  -9  " - 5}
ответ: -14

null + 1 = ${null + 1}
ответ: 1 (запомнить: null становится 0 после численного преобразования)

undefined + 1 = ${undefined + 1}
ответ: Nan

" \\t \\n" - 2 = ${" \t \n" - 2}
ответ: -2 (запомнить: пустая строка приводится к нолю)`);